<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Aggregating-and-Combining-pandas-DataFrames" data-toc-modified-id="Aggregating-and-Combining-pandas-DataFrames-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Aggregating and Combining <code>pandas</code> DataFrames</a></span><ul class="toc-item"><li><span><a href="#Learning-Goals" data-toc-modified-id="Learning-Goals-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Learning Goals</a></span><ul class="toc-item"><li><span><a href="#Austin-Animal-Center-Data" data-toc-modified-id="Austin-Animal-Center-Data-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>Austin Animal Center Data</a></span></li></ul></li><li><span><a href="#Aggregating-over-DataFrames:-.groupby()" data-toc-modified-id="Aggregating-over-DataFrames:-.groupby()-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Aggregating over DataFrames: <code>.groupby()</code></a></span><ul class="toc-item"><li><span><a href="#.groups-and-.get_group()" data-toc-modified-id=".groups-and-.get_group()-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span><code>.groups</code> and <code>.get_group()</code></a></span><ul class="toc-item"><li><span><a href="#Multi-Indexing" data-toc-modified-id="Multi-Indexing-1.2.1.1"><span class="toc-item-num">1.2.1.1&nbsp;&nbsp;</span>Multi-Indexing</a></span></li></ul></li><li><span><a href="#Aggregating" data-toc-modified-id="Aggregating-1.2.2"><span class="toc-item-num">1.2.2&nbsp;&nbsp;</span>Aggregating</a></span></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.2.3"><span class="toc-item-num">1.2.3&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Pivoting-a-DataFrame" data-toc-modified-id="Pivoting-a-DataFrame-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Pivoting a DataFrame</a></span><ul class="toc-item"><li><span><a href="#.pivot_table()" data-toc-modified-id=".pivot_table()-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span><code>.pivot_table()</code></a></span><ul class="toc-item"><li><span><a href="#Example" data-toc-modified-id="Example-1.3.1.1"><span class="toc-item-num">1.3.1.1&nbsp;&nbsp;</span>Example</a></span></li><li><span><a href="#Back-to-Austin-animals" data-toc-modified-id="Back-to-Austin-animals-1.3.1.2"><span class="toc-item-num">1.3.1.2&nbsp;&nbsp;</span>Back to Austin animals</a></span></li></ul></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Methods-for-Combining-DataFrames:-.join(),-.merge(),-pd.concat()" data-toc-modified-id="Methods-for-Combining-DataFrames:-.join(),-.merge(),-pd.concat()-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Methods for Combining DataFrames: <code>.join()</code>, <code>.merge()</code>, <code>pd.concat()</code></a></span><ul class="toc-item"><li><span><a href="#.join()" data-toc-modified-id=".join()-1.4.1"><span class="toc-item-num">1.4.1&nbsp;&nbsp;</span><code>.join()</code></a></span></li><li><span><a href="#.merge()" data-toc-modified-id=".merge()-1.4.2"><span class="toc-item-num">1.4.2&nbsp;&nbsp;</span><code>.merge()</code></a></span></li><li><span><a href="#The-how-Parameter" data-toc-modified-id="The-how-Parameter-1.4.3"><span class="toc-item-num">1.4.3&nbsp;&nbsp;</span>The <code>how</code> Parameter</a></span></li><li><span><a href="#pd.concat()" data-toc-modified-id="pd.concat()-1.4.4"><span class="toc-item-num">1.4.4&nbsp;&nbsp;</span><code>pd.concat()</code></a></span></li><li><span><a href="#EXTRA" data-toc-modified-id="EXTRA-1.4.5"><span class="toc-item-num">1.4.5&nbsp;&nbsp;</span>EXTRA</a></span></li></ul></li><li><span><a href="#King-County-Assessments" data-toc-modified-id="King-County-Assessments-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>King County Assessments</a></span><ul class="toc-item"><li><span><a href="#First,-get-the-data!" data-toc-modified-id="First,-get-the-data!-1.5.1"><span class="toc-item-num">1.5.1&nbsp;&nbsp;</span>First, get the data!</a></span></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.5.2"><span class="toc-item-num">1.5.2&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Time-Permitting:-Data-Cleaning-with-Pandas" data-toc-modified-id="Time-Permitting:-Data-Cleaning-with-Pandas-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Time Permitting: Data Cleaning with Pandas</a></span><ul class="toc-item"><li><span><a href="#1.-Investigate-and-drop-rows-with-invalid-values-in-the-SalePrice-and-SqFtTotLiving-columns." data-toc-modified-id="1.-Investigate-and-drop-rows-with-invalid-values-in-the-SalePrice-and-SqFtTotLiving-columns.-1.6.1"><span class="toc-item-num">1.6.1&nbsp;&nbsp;</span>1. Investigate and drop rows with invalid values in the SalePrice and SqFtTotLiving columns.</a></span></li><li><span><a href="#2.-Investigate-and-handle-non-numeric-ZipCode-values" data-toc-modified-id="2.-Investigate-and-handle-non-numeric-ZipCode-values-1.6.2"><span class="toc-item-num">1.6.2&nbsp;&nbsp;</span>2. Investigate and handle non-numeric ZipCode values</a></span></li><li><span><a href="#3.-Add-a-column-for-PricePerSqFt" data-toc-modified-id="3.-Add-a-column-for-PricePerSqFt-1.6.3"><span class="toc-item-num">1.6.3&nbsp;&nbsp;</span>3. Add a column for PricePerSqFt</a></span></li><li><span><a href="#4.-Subset-the-data-to-2021-sales-only." data-toc-modified-id="4.-Subset-the-data-to-2021-sales-only.-1.6.4"><span class="toc-item-num">1.6.4&nbsp;&nbsp;</span>4. Subset the data to 2021 sales only.</a></span></li><li><span><a href="#5.-What-is-the-mean-price-per-square-foot-for-a-house-sold-in-Seattle-in-2021?" data-toc-modified-id="5.-What-is-the-mean-price-per-square-foot-for-a-house-sold-in-Seattle-in-2021?-1.6.5"><span class="toc-item-num">1.6.5&nbsp;&nbsp;</span>5. What is the mean price per square foot for a house sold in Seattle in 2021?</a></span></li></ul></li><li><span><a href="#Level-Up:-pandas.set_option()" data-toc-modified-id="Level-Up:-pandas.set_option()-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>Level Up: <code>pandas.set_option()</code></a></span><ul class="toc-item"><li><span><a href="#Block-Scientific-Notation" data-toc-modified-id="Block-Scientific-Notation-1.7.1"><span class="toc-item-num">1.7.1&nbsp;&nbsp;</span>Block Scientific Notation</a></span></li><li><span><a href="#See-More-Rows" data-toc-modified-id="See-More-Rows-1.7.2"><span class="toc-item-num">1.7.2&nbsp;&nbsp;</span>See More Rows</a></span></li></ul></li></ul></li></ul></div>

# Aggregating and Combining `pandas` DataFrames

In [1]:
import pandas as pd
import numpy as np
import requests as rq
from sklearn.preprocessing import OneHotEncoder
from zipfile import ZipFile

## Learning Goals

- Use GroupBy objects to organize and aggregate data
- Create pivot tables from DataFrames
- Combine DataFrames by merging and appending

We'll work with the Austin Animal Center dataset and with data from King County's Department of Assessments (Seattle housing data).

### Austin Animal Center Data

In [2]:
data = rq.get('https://data.austintexas.gov/resource/9t4d-g238.json').text

In [3]:
animals = pd.read_json(data)

In [4]:
animals.head()

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color
0,A865701,"Kaeko (Kay-Ko) ""Kaeks""",2022-10-13 08:29:00,2022-10-13T08:29:00.000,2022-01-15T00:00:00.000,Adoption,Foster,Cat,Spayed Female,8 months,Domestic Shorthair,Calico
1,A866862,A866862,2022-10-12 18:31:00,2022-10-12T18:31:00.000,2022-08-07T00:00:00.000,Adoption,NaN,Dog,Spayed Female,2 months,Pit Bull,Black/White
2,A864090,Bella,2022-10-12 18:20:00,2022-10-12T18:20:00.000,2022-04-11T00:00:00.000,Return to Owner,NaN,Dog,Intact Female,6 months,English Springer Spaniel,White/Liver
3,A705094,Magna,2022-10-12 17:46:00,2022-10-12T17:46:00.000,2014-06-18T00:00:00.000,Euthanasia,Rabies Risk,Dog,NULL,NULL,Staffordshire Mix,Blue/White
4,A867153,Housecat,2022-10-12 16:56:00,2022-10-12T16:56:00.000,2006-10-12T00:00:00.000,Return to Owner,NaN,Cat,Neutered Male,16 years,Domestic Shorthair Mix,Brown Tabby/White

## Aggregating over DataFrames: `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. (And if you haven't, you'll see it very soon!) Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [5]:
animals.groupby('animal_type')

In [6]:
animals.columns

Index(['animal_id', 'name', 'datetime', 'monthyear', 'date_of_birth',
       'outcome_type', 'outcome_subtype', 'animal_type', 'sex_upon_outcome',
       'age_upon_outcome', 'breed', 'color'],
      dtype='object')

We can group by multiple columns, and also return a DataFrameGroupBy object

Notice the object type [DataFrameGroupBy](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html) object.

### `.groups` and `.get_group()`

In [7]:
animals.groupby(['animal_type', 'outcome_type'])

In [8]:
# This retuns each group indexed by the group name: I.E. 'Bird', along with the row indices of each value
animals.groupby('animal_type').groups

{'Bird': [441], 'Cat': [0, 4, 5, 6, 7, 8, 10, 11, 14, 15, 16, 19, 20, 21, 22, 24, 25, 26, 27, 28, 31, 33, 35, 36, 44, 45, 46, 48, 49, 50, 51, 53, 59, 63, 64, 66, 67, 68, 71, 77, 78, 79, 80, 111, 112, 113, 114, 115, 116, 117, 118, 119, 121, 126, 127, 131, 132, 133, 134, 141, 142, 146, 152, 160, 161, 162, 163, 166, 167, 169, 170, 171, 176, 181, 183, 187, 188, 191, 193, 194, 198, 205, 212, 215, 217, 222, 223, 224, 225, 226, 227, 228, 229, 236, 240, 243, 246, 251, 253, 256, ...], 'Dog': [1, 2, 3, 9, 12, 13, 17, 18, 23, 29, 30, 32, 34, 37, 38, 39, 41, 42, 43, 47, 52, 55, 56, 57, 60, 61, 62, 65, 69, 70, 72, 73, 74, 75, 76, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 120, 122, 123, 124, 125, 128, 129, 130, 137, 138, 139, 140, 145, 147, 148, 149, 150, 151, 153, 154, 155, 156, 157, 158, 159, 164, 165, 168, 173, 174, 175, 177, 178, 179, 180, ...], 'Other': [40, 54, 58, 135, 136, 143, 144, 172, 189, 190, 195, 207, 210, 219, 262, 296, 304, 322, 324, 332, 334, 368, 377, 474, 490, 585, 586, 589, 590, 591, 616, 680, 681, 682, 683, 684, 685, 750, 780, 790, 801, 870, 871, 874, 934, 959, 982]}

Once we know we are working with a type of object, it opens up a suite of attributes and methods. One attribute we can look at is groups.

In [9]:
# Once we know the group indices, we can return the groups using those indices.
animals.groupby('animal_type').get_group('Dog')

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color
1,A866862,A866862,2022-10-12 18:31:00,2022-10-12T18:31:00.000,2022-08-07T00:00:00.000,Adoption,NaN,Dog,Spayed Female,2 months,Pit Bull,Black/White
2,A864090,Bella,2022-10-12 18:20:00,2022-10-12T18:20:00.000,2022-04-11T00:00:00.000,Return to Owner,NaN,Dog,Intact Female,6 months,English Springer Spaniel,White/Liver
3,A705094,Magna,2022-10-12 17:46:00,2022-10-12T17:46:00.000,2014-06-18T00:00:00.000,Euthanasia,Rabies Risk,Dog,NULL,NULL,Staffordshire Mix,Blue/White
9,A866756,Oreo,2022-10-12 16:13:00,2022-10-12T16:13:00.000,2020-10-06T00:00:00.000,Rto-Adopt,NaN,Dog,Neutered Male,2 years,Pit Bull Mix,Black/White
12,A830333,Test,2022-10-12 14:51:00,2022-10-12T14:51:00.000,2022-10-12T14:51:00.000,Return to Owner,NaN,Dog,NULL,NULL,Kuvasz,Unknown
...,...,...,...,...,...,...,...,...,...,...,...,...
987,A859823,Canila,2022-09-12 18:05:00,2022-09-12T18:05:00.000,2021-08-20T00:00:00.000,Adoption,NaN,Dog,Spayed Female,1 year,Belgian Malinois,Brown/Black
989,A862742,*Morel,2022-09-12 17:45:00,2022-09-12T17:45:00.000,2022-05-15T00:00:00.000,Adoption,NaN,Dog,Neutered Male,3 months,Labrador Retriever Mix,Brown Brindle/White
992,A865218,Kiara,2022-09-12 17:25:00,2022-09-12T17:25:00.000,2022-07-07T00:00:00.000,Adoption,NaN,Dog,Spayed Female,2 months,Labrador Retriever Mix,Brown/White
994,A865121,*Winona,2022-09-12 17:17:00,2022-09-12T17:17:00.000,2022-04-06T00:00:00.000,Adoption,NaN,Dog,Spayed Female,5 months,Siberian Husky,White/Black
998,A863777,Lucky,2022-09-12 16:59:00,2022-09-12T16:59:00.000,2019-08-16T00:00:00.000,Adoption,NaN,Dog,Neutered Male,3 years,Dachshund,Brown

How would you get the same dataframe using dataframe slicing?

In [10]:
animals[animals['animal_type']=='Dog']

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color
1,A866862,A866862,2022-10-12 18:31:00,2022-10-12T18:31:00.000,2022-08-07T00:00:00.000,Adoption,NaN,Dog,Spayed Female,2 months,Pit Bull,Black/White
2,A864090,Bella,2022-10-12 18:20:00,2022-10-12T18:20:00.000,2022-04-11T00:00:00.000,Return to Owner,NaN,Dog,Intact Female,6 months,English Springer Spaniel,White/Liver
3,A705094,Magna,2022-10-12 17:46:00,2022-10-12T17:46:00.000,2014-06-18T00:00:00.000,Euthanasia,Rabies Risk,Dog,NULL,NULL,Staffordshire Mix,Blue/White
9,A866756,Oreo,2022-10-12 16:13:00,2022-10-12T16:13:00.000,2020-10-06T00:00:00.000,Rto-Adopt,NaN,Dog,Neutered Male,2 years,Pit Bull Mix,Black/White
12,A830333,Test,2022-10-12 14:51:00,2022-10-12T14:51:00.000,2022-10-12T14:51:00.000,Return to Owner,NaN,Dog,NULL,NULL,Kuvasz,Unknown
...,...,...,...,...,...,...,...,...,...,...,...,...
987,A859823,Canila,2022-09-12 18:05:00,2022-09-12T18:05:00.000,2021-08-20T00:00:00.000,Adoption,NaN,Dog,Spayed Female,1 year,Belgian Malinois,Brown/Black
989,A862742,*Morel,2022-09-12 17:45:00,2022-09-12T17:45:00.000,2022-05-15T00:00:00.000,Adoption,NaN,Dog,Neutered Male,3 months,Labrador Retriever Mix,Brown Brindle/White
992,A865218,Kiara,2022-09-12 17:25:00,2022-09-12T17:25:00.000,2022-07-07T00:00:00.000,Adoption,NaN,Dog,Spayed Female,2 months,Labrador Retriever Mix,Brown/White
994,A865121,*Winona,2022-09-12 17:17:00,2022-09-12T17:17:00.000,2022-04-06T00:00:00.000,Adoption,NaN,Dog,Spayed Female,5 months,Siberian Husky,White/Black
998,A863777,Lucky,2022-09-12 16:59:00,2022-09-12T16:59:00.000,2019-08-16T00:00:00.000,Adoption,NaN,Dog,Neutered Male,3 years,Dachshund,Brown

#### Multi-Indexing

In [11]:
# Same goes for multi index groupbys
animal_outcome = animals.groupby(['animal_type', 'outcome_type'])
animal_outcome.groups

{('Bird', 'Transfer'): [441], ('Cat', 'Adoption'): [0, 5, 6, 7, 8, 10, 11, 14, 15, 16, 19, 21, 22, 24, 25, 26, 27, 28, 31, 33, 35, 36, 48, 49, 50, 51, 53, 59, 63, 64, 66, 67, 68, 71, 126, 127, 131, 132, 133, 134, 141, 142, 146, 152, 160, 161, 162, 163, 166, 167, 169, 170, 171, 183, 187, 188, 191, 198, 212, 215, 217, 222, 223, 224, 225, 226, 227, 228, 229, 236, 240, 243, 246, 253, 256, 260, 263, 264, 265, 268, 275, 276, 281, 283, 288, 289, 303, 306, 309, 310, 311, 312, 313, 317, 318, 319, 320, 327, 333, 335, ...], ('Cat', 'Died'): [270, 328, 531, 715], ('Cat', 'Disposal'): [935], ('Cat', 'Euthanasia'): [46, 251, 266, 291, 625, 779, 783, 883, 901, 955], ('Cat', 'Missing'): [555], ('Cat', 'Return to Owner'): [4, 121, 205, 305, 495, 645, 694], ('Cat', 'Rto-Adopt'): [299, 945], ('Cat', 'Transfer'): [20, 44, 45, 77, 78, 79, 80, 111, 112, 113, 114, 115, 116, 117, 118, 119, 176, 181, 193, 194, 287, 293, 294, 297, 298, 314, 315, 326, 364, 365, 465, 548, 551, 565, 610, 641, 671, 672, 674, 709, 877, 878, 903, 904, 905, 906, 907, 908, 979, 990], ('Dog', 'Adoption'): [1, 23, 30, 34, 38, 39, 43, 52, 55, 56, 57, 60, 61, 62, 65, 69, 70, 72, 73, 74, 75, 76, 120, 123, 137, 138, 139, 140, 145, 147, 148, 149, 150, 151, 153, 154, 155, 159, 164, 168, 174, 175, 177, 178, 179, 182, 184, 186, 208, 209, 213, 214, 218, 220, 221, 232, 233, 234, 235, 241, 242, 244, 245, 247, 248, 250, 252, 254, 255, 257, 258, 259, 261, 269, 271, 272, 274, 277, 278, 279, 280, 282, 284, 285, 290, 301, 302, 307, 308, 316, 323, 329, 330, 331, 336, 338, 339, 340, 341, 342, ...], ('Dog', 'Died'): [199, 230, 895], ('Dog', 'Disposal'): [414], ('Dog', 'Euthanasia'): [3, 29, 887], ('Dog', 'Return to Owner'): [2, 12, 17, 18, 32, 124, 125, 128, 165, 173, 185, 192, 200, 206, 211, 216, 249, 267, 273, 295, 300, 337, 351, 356, 358, 373, 412, 418, 503, 527, 543, 546, 563, 564, 588, 639, 643, 665, 675, 679, 696, 705, 716, 717, 720, 726, 765, 774, 784, 806, 813, 814, 833, 926, 930, 933, 948, 978], ('Dog', 'Rto-Adopt'): [9, 37, 41, 42, 196, 201, 202, 203, 204, 292, 443, 475, 648, 656, 847, 910, 952], ('Dog', 'Transfer'): [13, 47, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 122, 129, 130, 156, 157, 158, 180, 197, 231, 237, 238, 239, 286, 321, 325, 343, 344, 345, 346, 347, 348, 349, 350, 352, 353, 354, 355, 357, 360, 362, 363, 393, 411, 434, 436, 437, 496, 529, 547, 592, 593, 594, 595, 596, 597, 598, 599, 600, 601, 602, 628, 629, 630, 631, 632, 633, 634, 635, 664, 668, 669, 670, 673, 677, 724, 809, 831, 835, ...], ('Other', 'Adoption'): [135, 136, 143, 144, 207, 585, 586, 589, 590, 591, 683, 684, 685, 871, 934, 959, 982], ('Other', 'Died'): [172], ('Other', 'Disposal'): [219, 474], ('Other', 'Euthanasia'): [40, 54, 58, 189, 190, 195, 210, 262, 296, 322, 332, 334, 368, 377, 490, 616, 680, 681, 682, 750, 780, 790, 870, 874], ('Other', 'Return to Owner'): [304, 324, 801]}

In [12]:
# animal_outcome.groups is a dictionary, so we can access the group names using keys()
animal_outcome.groups.keys()

dict_keys([('Bird', 'Transfer'), ('Cat', 'Adoption'), ('Cat', 'Died'), ('Cat', 'Disposal'), ('Cat', 'Euthanasia'), ('Cat', 'Missing'), ('Cat', 'Return to Owner'), ('Cat', 'Rto-Adopt'), ('Cat', 'Transfer'), ('Dog', 'Adoption'), ('Dog', 'Died'), ('Dog', 'Disposal'), ('Dog', 'Euthanasia'), ('Dog', 'Return to Owner'), ('Dog', 'Rto-Adopt'), ('Dog', 'Transfer'), ('Other', 'Adoption'), ('Other', 'Died'), ('Other', 'Disposal'), ('Other', 'Euthanasia'), ('Other', 'Return to Owner')])

In [13]:
# We can then get a specific group, such as Cats that were adopted
animal_outcome.get_group(('Cat', 'Adoption'))

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color
0,A865701,"Kaeko (Kay-Ko) ""Kaeks""",2022-10-13 08:29:00,2022-10-13T08:29:00.000,2022-01-15T00:00:00.000,Adoption,Foster,Cat,Spayed Female,8 months,Domestic Shorthair,Calico
5,A866616,*Patchy The Pirate,2022-10-12 16:52:00,2022-10-12T16:52:00.000,2022-07-19T00:00:00.000,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair,White/Black
6,A866867,Tortilla,2022-10-12 16:37:00,2022-10-12T16:37:00.000,2022-07-07T00:00:00.000,Adoption,NaN,Cat,Neutered Male,3 months,Domestic Shorthair,Orange Tabby
7,A866838,A866838,2022-10-12 16:27:00,2022-10-12T16:27:00.000,2022-08-03T00:00:00.000,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair,White/Orange Tabby
8,A866787,Nova,2022-10-12 16:26:00,2022-10-12T16:26:00.000,2022-04-06T00:00:00.000,Adoption,NaN,Cat,Spayed Female,6 months,Domestic Shorthair,Torbie
...,...,...,...,...,...,...,...,...,...,...,...,...
993,A864606,*Pebbles,2022-09-12 17:21:00,2022-09-12T17:21:00.000,2022-06-19T00:00:00.000,Adoption,NaN,Cat,Spayed Female,2 months,Domestic Shorthair,Brown Tabby
995,A864999,*Marie,2022-09-12 17:11:00,2022-09-12T17:11:00.000,2020-09-03T00:00:00.000,Adoption,NaN,Cat,Spayed Female,2 years,Domestic Shorthair,Blue/White
996,A865010,856010,2022-09-12 17:06:00,2022-09-12T17:06:00.000,2022-04-03T00:00:00.000,Adoption,NaN,Cat,Spayed Female,5 months,Domestic Shorthair,Brown Tabby
997,A865333,*Riley,2022-09-12 17:00:00,2022-09-12T17:00:00.000,2022-04-24T00:00:00.000,Adoption,NaN,Cat,Spayed Female,4 months,Siamese Mix,Lynx Point
999,A856992,*Celeste,2022-09-12 16:53:00,2022-09-12T16:53:00.000,2021-09-10T00:00:00.000,Adoption,NaN,Cat,Spayed Female,1 year,Domestic Shorthair,Orange Tabby

In [14]:
# do same in one line
animals[(animals['outcome_type']=='Adoption')&(animals['animal_type']=='Cat')]

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color
0,A865701,"Kaeko (Kay-Ko) ""Kaeks""",2022-10-13 08:29:00,2022-10-13T08:29:00.000,2022-01-15T00:00:00.000,Adoption,Foster,Cat,Spayed Female,8 months,Domestic Shorthair,Calico
5,A866616,*Patchy The Pirate,2022-10-12 16:52:00,2022-10-12T16:52:00.000,2022-07-19T00:00:00.000,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair,White/Black
6,A866867,Tortilla,2022-10-12 16:37:00,2022-10-12T16:37:00.000,2022-07-07T00:00:00.000,Adoption,NaN,Cat,Neutered Male,3 months,Domestic Shorthair,Orange Tabby
7,A866838,A866838,2022-10-12 16:27:00,2022-10-12T16:27:00.000,2022-08-03T00:00:00.000,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair,White/Orange Tabby
8,A866787,Nova,2022-10-12 16:26:00,2022-10-12T16:26:00.000,2022-04-06T00:00:00.000,Adoption,NaN,Cat,Spayed Female,6 months,Domestic Shorthair,Torbie
...,...,...,...,...,...,...,...,...,...,...,...,...
993,A864606,*Pebbles,2022-09-12 17:21:00,2022-09-12T17:21:00.000,2022-06-19T00:00:00.000,Adoption,NaN,Cat,Spayed Female,2 months,Domestic Shorthair,Brown Tabby
995,A864999,*Marie,2022-09-12 17:11:00,2022-09-12T17:11:00.000,2020-09-03T00:00:00.000,Adoption,NaN,Cat,Spayed Female,2 years,Domestic Shorthair,Blue/White
996,A865010,856010,2022-09-12 17:06:00,2022-09-12T17:06:00.000,2022-04-03T00:00:00.000,Adoption,NaN,Cat,Spayed Female,5 months,Domestic Shorthair,Brown Tabby
997,A865333,*Riley,2022-09-12 17:00:00,2022-09-12T17:00:00.000,2022-04-24T00:00:00.000,Adoption,NaN,Cat,Spayed Female,4 months,Siamese Mix,Lynx Point
999,A856992,*Celeste,2022-09-12 16:53:00,2022-09-12T16:53:00.000,2021-09-10T00:00:00.000,Adoption,NaN,Cat,Spayed Female,1 year,Domestic Shorthair,Orange Tabby

### Aggregating

Once again, as we will see in SQL, groupby objects are intended to be used with aggregation. In SQL, we will see that our queries that include GROUP BY require aggregation performed on columns.

We can use `.sum()`, `.mean()`, `.count()`, `.max()`, `.min()`, etc. Find a list of common aggregations [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html).

In [15]:
animals.groupby('animal_type').count()

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,sex_upon_outcome,age_upon_outcome,breed,color
animal_type,,,,,,,,,,,
Bird,1,0,1,1,1,1,1,1,1,1,1
Cat,396,351,396,396,396,396,159,396,396,396,396
Dog,556,479,556,556,556,556,242,556,556,556,556
Other,47,20,47,47,47,47,36,47,47,47,47

### Exercise

Use `.groupby()` to find the most recently born of each (main) animal type.

In [19]:
animals.groupby('animal_type')['date_of_birth'].max()

animal_type
Bird     2021-09-08T00:00:00.000
Cat      2022-10-03T00:00:00.000
Dog      2022-10-12T14:51:00.000
Other    2022-08-27T00:00:00.000
Name: date_of_birth, dtype: object

<details>
    <summary>Answer</summary>
    <code>animals.groupby('animal_type')['date_of_birth'].max()</code>
    </details>

## Pivoting a DataFrame

### `.pivot_table()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

Grouping by two different columns can be very helpful.

In [20]:
animals.groupby(by=['outcome_type', 'sex_upon_outcome']).agg(len)

                                  animal_id  name  datetime  monthyear  \
outcome_type    sex_upon_outcome
Adoption        Intact Female            15    15        15         15
                Intact Male              17    17        17         17
                Neutered Male           326   326       326        326
                Spayed Female           326   326       326        326
Died            Intact Male               5     5         5          5
                Spayed Female             1     1         1          1
                Unknown                   2     2         2          2
Disposal        Neutered Male             1     1         1          1
                Unknown                   3     3         3          3
Euthanasia      Intact Female             5     5         5          5
                Intact Male               5     5         5          5
                NULL                      1     1         1          1
                Spayed Female             2     2         2          2
                Unknown                  24    24        24         24
Missing         Spayed Female             1     1         1          1
Return to Owner Intact Female            16    16        16         16
                Intact Male              19    19        19         19
                NULL                      1     1         1          1
                Neutered Male            17    17        17         17
                Spayed Female            14    14        14         14
                Unknown                   1     1         1          1
Rto-Adopt       Intact Female             1     1         1          1
                Intact Male               1     1         1          1
                Neutered Male            13    13        13         13
                Spayed Female             4     4         4          4
Transfer        Intact Female            65    65        65         65
                Intact Male              49    49        49         49
                Neutered Male            38    38        38         38
                Spayed Female            17    17        17         17
                Unknown                  10    10        10         10

                                  date_of_birth  outcome_subtype  animal_type  \
outcome_type    sex_upon_outcome
Adoption        Intact Female                15               15           15
                Intact Male                  17               17           17
                Neutered Male               326              326          326
                Spayed Female               326              326          326
Died            Intact Male                   5                5            5
                Spayed Female                 1                1            1
                Unknown                       2                2            2
Disposal        Neutered Male                 1                1            1
                Unknown                       3                3            3
Euthanasia      Intact Female                 5                5            5
                Intact Male                   5                5            5
                NULL                          1                1            1
                Spayed Female                 2                2            2
                Unknown                      24               24           24
Missing         Spayed Female                 1                1            1
Return to Owner Intact Female                16               16           16
                Intact Male                  19               19           19
                NULL                          1                1            1
                Neutered Male                17               17           17
                Spayed Female                14               14           14
                Unknown                       1                1            1
Rto-Adopt       Intact Female                 1                1            1
                Intact Male                   1                1            1
                Neutered Male                13               13           13
                Spayed Female                 4                4            4
Transfer        Intact Female                65               65           65
                Intact Male                  49               49           49
                Neutered Male                38               38           38
                Spayed Female                17               17           17
                Unknown                      10               10           10

                                  age_upon_outcome  breed  color
outcome_type    sex_upon_outcome
Adoption        Intact Female                   15     15     15
                Intact Male                     17     17     17
                Neutered Male                  326    326    326
                Spayed Female                  326    326    326
Died            Intact Male                      5      5      5
                Spayed Female                    1      1      1
                Unknown                          2      2      2
Disposal        Neutered Male                    1      1      1
                Unknown                          3      3      3
Euthanasia      Intact Female                    5      5      5
                Intact Male                      5      5      5
                NULL                             1      1      1
                Spayed Female                    2      2      2
                Unknown                         24     24     24
Missing         Spayed Female                    1      1      1
Return to Owner Intact Female                   16     16     16
                Intact Male                     19     19     19
                NULL                             1      1      1
                Neutered Male                   17     17     17
                Spayed Female                   14     14     14
                Unknown                          1      1      1
Rto-Adopt       Intact Female                    1      1      1
                Intact Male                      1      1      1
                Neutered Male                   13     13     13
                Spayed Female                    4      4      4
Transfer        Intact Female                   65     65     65
                Intact Male                     49     49     49
                Neutered Male                   38     38     38
                Spayed Female                   17     17     17
                Unknown                         10     10     10

But it has the unsavory side effect of creating a two-level index. This can be a good time to use `.pivot_table()`.

(There is also a `.pivot()`. For the somewhat subtle differences, see [here](https://stackoverflow.com/questions/30960338/pandas-difference-between-pivot-and-pivot-table-why-is-only-pivot-table-workin).)

#### Example

In [21]:
df = pd.DataFrame({"sex": ["male", "male", "male", "male", "male",
                          "female", "female", "female", "female"],
                    "num_puppies": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "breed": ["terrier", "retriever", "retriever", "terrier",
                          "terrier", "retriever", "terrier", "terrier",
                          "retriever"],
                    "past_owners": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "family_members": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

      sex num_puppies      breed  past_owners  family_members
0    male         one    terrier            1               2
1    male         one  retriever            2               4
2    male         one  retriever            2               5
3    male         two    terrier            3               5
4    male         two    terrier            3               6
5  female         one  retriever            4               6
6  female         one    terrier            5               8
7  female         two    terrier            6               9
8  female         two  retriever            7               9

In [22]:
# This first example aggregates values by taking the sum.

table = pd.pivot_table(df, values='past_owners', index=['sex', 'num_puppies'],
                     columns=['breed'], aggfunc=np.sum)
table

breed               retriever  terrier
sex    num_puppies
female one                4.0      5.0
       two                7.0      6.0
male   one                4.0      1.0
       two                NaN      6.0

#### Back to Austin animals

In [23]:
animals.pivot_table(index='outcome_type', columns='sex_upon_outcome', aggfunc=len)

                 age_upon_outcome                                 \
sex_upon_outcome    Intact Female Intact Male NULL Neutered Male
outcome_type
Adoption                     15.0        17.0  NaN         326.0
Died                          NaN         5.0  NaN           NaN
Disposal                      NaN         NaN  NaN           1.0
Euthanasia                    5.0         5.0  1.0           NaN
Missing                       NaN         NaN  NaN           NaN
Return to Owner              16.0        19.0  1.0          17.0
Rto-Adopt                     1.0         1.0  NaN          13.0
Transfer                     65.0        49.0  NaN          38.0

                                           animal_id                   \
sex_upon_outcome Spayed Female Unknown Intact Female Intact Male NULL
outcome_type
Adoption                 326.0     NaN          15.0        17.0  NaN
Died                       1.0     2.0           NaN         5.0  NaN
Disposal                   NaN     3.0           NaN         NaN  NaN
Euthanasia                 2.0    24.0           5.0         5.0  1.0
Missing                    1.0     NaN           NaN         NaN  NaN
Return to Owner           14.0     1.0          16.0        19.0  1.0
Rto-Adopt                  4.0     NaN           1.0         1.0  NaN
Transfer                  17.0    10.0          65.0        49.0  NaN

                                ... name                                      \
sex_upon_outcome Neutered Male  ... NULL Neutered Male Spayed Female Unknown
outcome_type                    ...
Adoption                 326.0  ...  NaN         326.0         326.0     NaN
Died                       NaN  ...  NaN           NaN           1.0     2.0
Disposal                   1.0  ...  NaN           1.0           NaN     3.0
Euthanasia                 NaN  ...  1.0           NaN           2.0    24.0
Missing                    NaN  ...  NaN           NaN           1.0     NaN
Return to Owner           17.0  ...  1.0          17.0          14.0     1.0
Rto-Adopt                 13.0  ...  NaN          13.0           4.0     NaN
Transfer                  38.0  ...  NaN          38.0          17.0    10.0

                 outcome_subtype                                               \
sex_upon_outcome   Intact Female Intact Male NULL Neutered Male Spayed Female
outcome_type
Adoption                    15.0        17.0  NaN         326.0         326.0
Died                         NaN         5.0  NaN           NaN           1.0
Disposal                     NaN         NaN  NaN           1.0           NaN
Euthanasia                   5.0         5.0  1.0           NaN           2.0
Missing                      NaN         NaN  NaN           NaN           1.0
Return to Owner             16.0        19.0  1.0          17.0          14.0
Rto-Adopt                    1.0         1.0  NaN          13.0           4.0
Transfer                    65.0        49.0  NaN          38.0          17.0


sex_upon_outcome Unknown
outcome_type
Adoption             NaN
Died                 2.0
Disposal             3.0
Euthanasia          24.0
Missing              NaN
Return to Owner      1.0
Rto-Adopt            NaN
Transfer            10.0

[8 rows x 60 columns]

### Exercise

Use `.pivot_table()` to add up the number of my tasks by category. Hint: Use `sum()` as your aggregating function.

In [24]:
tasks = pd.DataFrame({'category': ['house', 'house', 'school', 'school'],
                      'descr': ['kitchen', 'laundry', 'git', 'Python'],
                      'priority': [2, 3, 4, 1], 'num_tasks': [2, 1, 2, 3]})

tasks

  category    descr  priority  num_tasks
0    house  kitchen         2          2
1    house  laundry         3          1
2   school      git         4          2
3   school   Python         1          3

In [25]:
tasks.pivot_table(values='num_tasks',index='category',aggfunc=sum)

          num_tasks
category
house             3
school            5

<details>
    <summary>Answer</summary>
    <code>tasks.pivot_table(values='num_tasks', index='category', aggfunc=sum)</code>
    </details>

## Methods for Combining DataFrames: `.join()`, `.merge()`, `pd.concat()`

### `.join()`

In [26]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns=['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns=['age', 'MP'])

toy1

   age   HP
0   63  142
1   33   47

In [27]:
toy2

   age   MP
0   63  100
1   33  200

In [29]:
# We can't just join these as they are, since we haven't specified our suffixes.

toy1.join(toy2)

In [30]:
toy1.join(toy2, lsuffix='1', rsuffix='2')

   age1   HP  age2   MP
0    63  142    63  100
1    33   47    33  200

If we don't want to keep both, we could set the overlapping column as the index in each DataFrame:

In [31]:
toy1.set_index('age').join(toy2.set_index('age'))

      HP   MP
age
63   142  100
33    47  200

For more on this method, check out the [doc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html)!

### `.merge()`

Or we could use `.merge()`:

In [32]:
toy1.merge(toy2)

   age   HP   MP
0   63  142  100
1   33   47  200

In [33]:
ds_chars = pd.read_csv('data/ds_chars.csv', index_col=0)
ds_chars

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [34]:
states = pd.read_csv('data/states.csv', index_col=0)
states

  state   nickname     capital
0    WA  evergreen     Olympia
1    TX      alamo      Austin
2    DC   district  Washington
3    OH    buckeye    Columbus
4    OR     beaver       Salem

### The `how` Parameter

This parameter in both `.join()` and `.merge()` tells the compiler what sort of join to effect. We'll cover this in detail when we discuss SQL.

In [35]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='inner')

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    WA  evergreen     Olympia
2    alan  170         TX    TX      alamo      Austin
3  rachel  200         TX    TX      alamo      Austin
4  alison  300         DC    DC   district  Washington

In [36]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='outer')

     name     HP home_state state   nickname     capital
0    greg  200.0         WA    WA  evergreen     Olympia
1   miles  200.0         WA    WA  evergreen     Olympia
2    alan  170.0         TX    TX      alamo      Austin
3  rachel  200.0         TX    TX      alamo      Austin
4  alison  300.0         DC    DC   district  Washington
5     NaN    NaN        NaN    OH    buckeye    Columbus
6     NaN    NaN        NaN    OR     beaver       Salem

### `pd.concat()`

This method takes a *list* of pandas objects as arguments.

In [37]:
ds_full = pd.concat([ds_chars, states])
ds_full

     name     HP home_state state   nickname     capital
0    greg  200.0         WA   NaN        NaN         NaN
1   miles  200.0         WA   NaN        NaN         NaN
2    alan  170.0         TX   NaN        NaN         NaN
3  alison  300.0         DC   NaN        NaN         NaN
4  rachel  200.0         TX   NaN        NaN         NaN
0     NaN    NaN        NaN    WA  evergreen     Olympia
1     NaN    NaN        NaN    TX      alamo      Austin
2     NaN    NaN        NaN    DC   district  Washington
3     NaN    NaN        NaN    OH    buckeye    Columbus
4     NaN    NaN        NaN    OR     beaver       Salem

`pd.concat()`–– and many other pandas operations –– make use of an `axis` parameter. For this particular method I need to specify whether I want to concatenate the DataFrames *row-wise* (`axis=0`) or *column-wise* (`axis=1`). The default is `axis=0`, so let's override that!

In [38]:
ds_full = pd.concat([ds_chars, states], axis=1)
ds_full

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    TX      alamo      Austin
2    alan  170         TX    DC   district  Washington
3  alison  300         DC    OH    buckeye    Columbus
4  rachel  200         TX    OR     beaver       Salem

### EXTRA

## King County Assessments

As data scientists, we want to build a model to predict the sale price of a house in Seattle in 2019, based on its square footage. We know that the King County Department of Assessments has comprehensive data available on real property sales in the Seattle area. We need to prepare the data.

### First, get the data!

Go [here](https://info.kingcounty.gov/assessor/DataDownload/default.aspx) and download two files: "Real Property Sales" and "Residential Building". Then unzip them. (Or you can run the cells below if you prefer.)

In [ ]:
# %%bash
# cd data
# curl -o property_sales.zip https://aqua.kingcounty.gov/extranet/assessor/Real%20Property%20Sales.zip

In [ ]:
# %%bash
# cd data
# curl -o res_bldg.zip https://aqua.kingcounty.gov/extranet/assessor/Residential%20Building.zip

In [ ]:
# zf = ZipFile('data/property_sales.zip', 'r')
# zf.extractall('data')
# zf.close()

In [ ]:
# zf = ZipFile('data/res_bldg.zip', 'r')
# zf.extractall('data')
# # zf.close()

In [ ]:
# You'll need to use a new encoding here. List of all encodings here:
# https://docs.python.org/3/library/codecs.html#standard-encodings

# Both of these csv files have many columns, so we'll just pre-select
# which ones we want to use.

sales_df = pd.read_csv('data/EXTR_RPSale.csv',
                       encoding='latin-1',
                       usecols=['Major', 'Minor', 'DocumentDate', 'SalePrice'])

In [ ]:
sales_df.info()

In [ ]:
bldg_df = pd.read_csv('data/EXTR_ResBldg.csv',
                     usecols=['Major', 'Minor', 'SqFtTotLiving', 'ZipCode'])

In [ ]:
bldg_df.info()

In [ ]:
sales_data = pd.merge(sales_df, bldg_df, on=['Major', 'Minor'])

In [ ]:
sales_data.head()

In [ ]:
sales_data.info()

We can see right away that we're missing ZIP codes for many of the sales transactions.

In [ ]:
sales_data.loc[sales_data['ZipCode'].isna()].head()

### Exercise

What percentage of housing records are missing ZIP codes?

<details>
    <summary>Answer</summary>
    <code>sales_data['ZipCode'].isna().sum() / sales_data.shape[0]</code>
    </details>

Let's drop the rows with missing zip codes.

In [ ]:
sales_data = sales_data.loc[~sales_data['ZipCode'].isna(), :]
#sales_data2 = sales_data[~sales_data['ZipCode'].isna()]
sales_data

## Time Permitting: Data Cleaning with Pandas

### 1. Investigate and drop rows with invalid values in the SalePrice and SqFtTotLiving columns.

<details>
    <summary>One possible answer here</summary>
    <code>sales_data = sales_data[sales_data['SalePrice'] > 10000]</code>
    </details>

### 2. Investigate and handle non-numeric ZipCode values

Can you find a way to shorten ZIP+4 codes to the first five digits?

In [ ]:
def is_integer(x):
    try:
        _ = int(x)
    except ValueError:
        return False
    return True

sales_data.loc[sales_data['ZipCode'].apply(is_integer) == False, 'ZipCode'].head()

<details>
    <summary>One possible answer here</summary>
    <code>def five_digit_ZIP(x):
    try:
        return int(str(x)[:5])
    except:
        return x
sales_data['ZipCode'] = sales_data['ZipCode'].map(five_digit_ZIP)
sales_data = sales_data.loc[sales_data['ZipCode'].apply(is_integer) == True, :]
sales_data['ZipCode'] = sales_data['ZipCode'].map(int)</code>
    </details>

### 3. Add a column for PricePerSqFt

<details>
    <summary>Answer here</summary>
    <code>sales_data['PricePerSqFt'] = sales_data['SalePrice'] / sales_data['SqFtTotLiving']</code>
    </details>

### 4. Subset the data to 2021 sales only.

We can assume that the DocumentDate is approximately the sale date.

<details>
    <summary>Answer here</summary>
    <code>sales_data['DocumentDate'] = pd.to_datetime(sales_data['DocumentDate'])
sales_data = sales_data.loc[sales_data['DocumentDate'] > '12/31/2020']</code>
    </details>

### 5. What is the mean price per square foot for a house sold in Seattle in 2021?

<details>
    <summary>Answer here</summary>
    <code>sales_data['PricePerSqFt'].mean()</code>
    </details>

## Level Up: `pandas.set_option()`

We can adjust how `pandas` works by setting options in advance.

### Block Scientific Notation

For example, suppose we want to prevent numbers from being displayed in scientific notation.

In [ ]:
df = pd.DataFrame([[1e9, 2e9], [3e9, 4e9]])
df

Then we can use:

In [ ]:
pd.set_option('display.float_format', '{:.2f}'.format)

df

### See More Rows

Or suppose we want `pandas` to show more rows.

In [ ]:
df2 = pd.DataFrame(np.array(range(100)))
df2

In that case we can use:

In [ ]:
pd.set_option('display.max_rows', 100)

df2

For complete documentation, see [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html).